test_riblet/damBreak/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.146;

vertices
(

    (0.000  0.000  0.000)
  	(2.000  0.000  0.000)
  	(3.243  0.000  0.000)
  	(4.485  0.000  0.000)
  	(6.485  0.000  0.000)
  	(0.000  3.000  0.000)
  	(2.000  3.000  0.000)
  	(3.243  3.000  0.000)
  	(4.485  3.000  0.000)
  	(6.485  3.000  0.000)
  	(0.000  11.000  0.000)
  	(2.000  11.000  0.000)
  	(3.243  11.000  0.000)
  	(4.485  11.000  0.000)
  	(6.485  11.000  0.000)
  	(0.000  0.000  0.100)
  	(2.000  0.000  0.100)
  	(3.243  0.000  0.100)
  	(4.485  0.000  0.100)
  	(6.485  0.000  0.100)
  	(0.000  3.000  0.100)
  	(2.000  3.000  0.100)
  	(3.243  3.000  0.100)
  	(4.485  3.000  0.100)
  	(6.485  3.000  0.100)
  	(0.000  11.000  0.100)
  	(2.000  11.000  0.100)
  	(3.243  11.000  0.100)
  	(4.485  11.000  0.100)
  	(6.485  11.000  0.100)


);

lfrac 0.1;
blocks
(
    hex (0 1 6 5 15 16 21 20) (20 20 1) simpleGrading (1 1 1) //block 1
    hex (1 7 7 6 16 22 22 21) (20 20 1) simpleGrading ($lfrac 1 1) //block 2 must match x-comp of block6
    hex (7 3 8 7 22 18 23 22) (20 20 1) simpleGrading (1 1 1) //block 3 must match x comp of block 7
    hex (3 4 9 8 18 19 24 23) (20 20 1) simpleGrading (1 1 1) //block 4
    hex (5 6 11 10 20 21 26 25) (20 20 1) simpleGrading (1 1 1) //block 5
    hex (6 7 12 11 21 22 27 26) (20 20 1) simpleGrading (0.1 1 1) //block 6
    hex (7 8 13 12 22 23 28 27) (20 20 1) simpleGrading (1 1 1) //block 7
    hex (8 9 14 13 23 24 29 28) (20 20 1) simpleGrading (1 1 1) //block 8
);

edges
(
);

boundary
(
    leftWall
    {
        type wall;
        faces
        (
            (0 5 20 15)
            (5 10 25 20)
        );
    }
    rightWall
    {
        type wall;
        faces
        (
            (19 24 9 4)
            (24 29 14 9)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 15 16 1)
            (1 16 22 7)
            (7 22 18 3)
            (3 18 19 4)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (10 11 26 25)
            (11 12 27 26)
            (12 13 28 27)
            (13 14 29 28)
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
